const branches = [
  { name: '1-й Верхний пер., 2', coord: [60.054826, 30.379982] },
  { name: 'ш. Революции, 84АБ', coord: [59.963156, 30.457883] },
  { name: 'просп. Динамо, 44', coord: [59.968079, 30.265652] },
  { name: 'пер. Челиева, 13В', coord: [59.889178, 30.477655] },
  { name: 'Приморский просп., 50Б', coord: [59.982533, 30.240089] },
  { name: 'Екатерининский просп., 3, корп. 2', coord: [59.977877, 30.438937] },
  { name: 'Петергофское ш., 5, корп. 3', coord: [59.848521, 30.204504] },
  { name: 'Афонская ул., 5', coord: [60.018014, 30.305678] },
]

export { branches }
